begin:
    hierarchy -check

coarse:
    proc;; opt_expr;; opt_clean;; check
    wreduce;; alumacc;; share;; opt
    fsm;; opt -fast;; memory -nomap;; opt_clean

fine:
    opt -fast -full
    memory_map
    opt -full
    techmap
    opt -fast
    abc -lut 2
    opt -fast

check:
    hierarchy -check
    stat
    check
